# SSDLite with MobileDet-EdgeTPU feature extractor.
# Reference: Xiong & Liu et al., https://arxiv.org/abs/2004.14525
# Trained on COCO, initialized from scratch.
#
# 1.53B MulAdds, 4.20M Parameters. Latency is 6.9ms on Pixel 4 EdgeTPU.
# Achieves 25.6 mAP on COCO14 minival dataset with quantization-aware training.
#
# This config is TPU compatible.
#
# This config retrains on the radar-ml data set and uses alt label map.

model {
  ssd {
    inplace_batchnorm_update: true
    freeze_batchnorm: true
    num_classes: 3
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    encode_background_as_zeros: true
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 320
        width: 320
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 3
        use_depthwise: true
        box_code_size: 4
        apply_sigmoid_to_scores: false
        class_prediction_bias_init: -4.6
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            random_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            #train: true,
            scale: true,
            center: true,
            decay: 0.97,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobiledet_edgetpu'
      min_depth: 16
      depth_multiplier: 1.0
      use_depthwise: true
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          #train: true,
          scale: true,
          center: true,
          decay: 0.97,
          epsilon: 0.001,
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    loss {
      classification_loss {
        weighted_sigmoid_focal {
          alpha: 0.75,
          gamma: 2.0
        }
      }
      localization_loss {
        weighted_smooth_l1 {
          delta: 1.0
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: true
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 32
  sync_replicas: true
  startup_delay_steps: 0
  replicas_to_aggregate: 32
  num_steps: 10000
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  sync_replicas: true
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: .002
          schedule {
            step: 2000
            learning_rate: .0002
          }
          schedule {
            step: 8000
            learning_rate: .00002
          }
        }
        #cosine_decay_learning_rate {
          #learning_rate_base: 0.001
          #total_steps: 10000
          #warmup_learning_rate: 0.0001
          #warmup_steps: 200
        #}
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint: "./checkpoints/ssd_mobiledet_edgetpu_coco/uint8/model.ckpt"
  from_detection_checkpoint: true
  load_all_detection_checkpoint_vars: true
  num_steps: 10000
  freeze_variables:[
    'FeatureExtractor/MobileDetEdgeTPU/Conv/',
    'FeatureExtractor/MobileDetEdgeTPU/TuckerConv/',
    'FeatureExtractor/MobileDetEdgeTPU/FusedConv/',
    'FeatureExtractor/MobileDetEdgeTPU/FusedConv_1/',
    'FeatureExtractor/MobileDetEdgeTPU/FusedConv_2/',
    'FeatureExtractor/MobileDetEdgeTPU/FusedConv_3/',
    'FeatureExtractor/MobileDetEdgeTPU/FusedConv_4/',
    'FeatureExtractor/MobileDetEdgeTPU/FusedConv_5/',
    'FeatureExtractor/MobileDetEdgeTPU/FusedConv_6/'
    'FeatureExtractor/MobileDetEdgeTPU/FusedConv_7/'
    #'FeatureExtractor/MobileDetEdgeTPU/IBN/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_1/',
    #'FeatureExtractor/MobileDetEdgeTPU/FusedConv_8/',
    #'FeatureExtractor/MobileDetEdgeTPU/FusedConv_9/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_2/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_3/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_4/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_5/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_6/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_7/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_8/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_9/',
    #'FeatureExtractor/MobileDetEdgeTPU/IBN_10/'
  ]
}

train_input_reader: {
  num_readers: 1
  label_map_path: "./annotations/radar-ml/alt_label_map.pbtxt"
  tf_record_input_reader {
    input_path: "./tf-record/radar-ml/train-00000-of-00001"
  }
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_examples: 8000
  num_visualizations: 100
}

eval_input_reader: {
  label_map_path: "./annotations/radar-ml/alt_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "./tf-record/radar-ml/val-00000-of-00001"
  }
}

graph_rewriter {
  quantization {
    delay: 10000
    weight_bits: 8
    activation_bits: 8
  }
}
